In [14]:
#pandas
#series(1d) and data frame(2d) r there in pandas 
import pandas as pd
l=['manish','rahul','jeet','harshit']
s=pd.Series(l)

In [8]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
s.index=['a','b','c','d']
s

a     manish
b      rahul
c       jeet
d    harshit
dtype: object

In [20]:
s.ndim

1

In [21]:
s.shape

(4,)

In [22]:
s.a

'manish'

In [17]:
s[0]

'manish'

In [23]:
s[1:3]

b    rahul
c     jeet
dtype: object

In [25]:
s[0:3:2]

a    manish
c      jeet
dtype: object

In [26]:
s1=pd.Series([1,2,3,4,5,6,7,8,9])
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [28]:
#none values create problem in data prediction and analysis...
#since they might return very low mean as their numerical value is treated as 0
import numpy as np
s1=pd.Series([1,2,3,4,np.nan,7,7,8])
s1
#thus to remove such problem we either have to remove these none values or have to assume any specific values for them

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    7.0
6    7.0
7    8.0
dtype: float64

In [29]:
s1.mean()

4.571428571428571

In [32]:
s1=pd.Series([1,2,np.nan,4,45,90,np.nan,8])
s1.mean()

25.0

In [33]:
s1

0     1.0
1     2.0
2     NaN
3     4.0
4    45.0
5    90.0
6     NaN
7     8.0
dtype: float64

In [36]:
s1.dropna(inplace=True)    ##none values got removed
s1                         ##but due to this whole row gets deleted

0     1.0
1     2.0
3     4.0
4    45.0
5    90.0
7     8.0
dtype: float64

In [37]:
s=pd.Series([45,34,1,np.nan,23,12,np.nan,90])
s

0    45.0
1    34.0
2     1.0
3     NaN
4    23.0
5    12.0
6     NaN
7    90.0
dtype: float64

In [59]:
##to remove above problem 
##we would fill the none values with other value i.e. the mean of the whole data
s.fill(s.mean(),inplace=True)
s

AttributeError: 'Series' object has no attribute 'fill'

In [53]:
s1

0     1.0
1     2.0
3     4.0
4    45.0
5    90.0
7     8.0
dtype: float64

In [54]:
l1=['manish','roahan','neha','rahul']
l=['jaipur','jodhur','mathura','agra']
l=pd.Series(l)
l

0     jaipur
1     jodhur
2    mathura
3       agra
dtype: object

In [55]:
l1=pd.Series(l1)
l1

0    manish
1    roahan
2      neha
3     rahul
dtype: object

In [56]:
pd.concat([l1,l])

0     manish
1     roahan
2       neha
3      rahul
0     jaipur
1     jodhur
2    mathura
3       agra
dtype: object

In [58]:
##data frame*******************
data={
    'name':['manish','rajeev','neha','jeet'],
    'addr':['jaipur','bombay','bharatpur','darjeeling'],
    'marks':[90,89,88,87]    
}
data=pd.DataFrame(data)
data

     name        addr  marks
0  manish      jaipur     90
1  rajeev      bombay     89
2    neha   bharatpur     88
3    jeet  darjeeling     87

In [60]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
data.index=['A','B','C','D']
data

     name        addr  marks
A  manish      jaipur     90
B  rajeev      bombay     89
C    neha   bharatpur     88
D    jeet  darjeeling     87

In [62]:
data.columns

Index(['name', 'addr', 'marks'], dtype='object')

In [66]:
data.columns=['fullname','cityname','percent']
data

  fullname    cityname  percent
A   manish      jaipur       90
B   rajeev      bombay       89
C     neha   bharatpur       88
D     jeet  darjeeling       87

In [67]:
data['fullname']

A    manish
B    rajeev
C      neha
D      jeet
Name: fullname, dtype: object

In [68]:
data['fullname'].count()

4

In [69]:
data.loc['A':'C']

  fullname   cityname  percent
A   manish     jaipur       90
B   rajeev     bombay       89
C     neha  bharatpur       88

In [72]:
data.index=data['percent']
data

        fullname    cityname  percent
percent
90        manish      jaipur       90
89        rajeev      bombay       89
88          neha   bharatpur       88
87          jeet  darjeeling       87

In [73]:
data[0:]

        fullname    cityname  percent
percent
90        manish      jaipur       90
89        rajeev      bombay       89
88          neha   bharatpur       88
87          jeet  darjeeling       87

In [74]:
data[0:2]

        fullname cityname  percent
percent
90        manish   jaipur       90
89        rajeev   bombay       89

In [75]:
data[0:]['fullname'],data['cityname']

(percent
 90    manish
 89    rajeev
 88      neha
 87      jeet
 Name: fullname, dtype: object, percent
 90        jaipur
 89        bombay
 88     bharatpur
 87    darjeeling
 Name: cityname, dtype: object)

In [77]:
data={
    'marks':[np.random.randint(50,100) for var in range(26)],
    'name':[chr(var) for var in range(65,91)],
    'project':[chr(var) for var in range(97,123)]
}
data

{'marks': [87,
  73,
  79,
  87,
  74,
  71,
  65,
  95,
  80,
  62,
  68,
  67,
  83,
  71,
  69,
  76,
  79,
  75,
  82,
  93,
  58,
  73,
  93,
  85,
  70,
  58],
 'name': ['A',
  'B',
  'C',
  'D',
  'E',
  'F',
  'G',
  'H',
  'I',
  'J',
  'K',
  'L',
  'M',
  'N',
  'O',
  'P',
  'Q',
  'R',
  'S',
  'T',
  'U',
  'V',
  'W',
  'X',
  'Y',
  'Z'],
 'project': ['a',
  'b',
  'c',
  'd',
  'e',
  'f',
  'g',
  'h',
  'i',
  'j',
  'k',
  'l',
  'm',
  'n',
  'o',
  'p',
  'q',
  'r',
  's',
  't',
  'u',
  'v',
  'w',
  'x',
  'y',
  'z']}

In [78]:
data=pd.DataFrame(data)
data

    marks name project
0      87    A       a
1      73    B       b
2      79    C       c
3      87    D       d
4      74    E       e
5      71    F       f
6      65    G       g
7      95    H       h
8      80    I       i
9      62    J       j
10     68    K       k
11     67    L       l
12     83    M       m
13     71    N       n
14     69    O       o
15     76    P       p
16     79    Q       q
17     75    R       r
18     82    S       s
19     93    T       t
20     58    U       u
21     73    V       v
22     93    W       w
23     85    X       x
24     70    Y       y
25     58    Z       z

In [79]:
date=pd.date_range('20190701',periods=26)
date

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-06', '2019-07-07', '2019-07-08',
               '2019-07-09', '2019-07-10', '2019-07-11', '2019-07-12',
               '2019-07-13', '2019-07-14', '2019-07-15', '2019-07-16',
               '2019-07-17', '2019-07-18', '2019-07-19', '2019-07-20',
               '2019-07-21', '2019-07-22', '2019-07-23', '2019-07-24',
               '2019-07-25', '2019-07-26'],
              dtype='datetime64[ns]', freq='D')

In [80]:
data.index=date
data

            marks name project
2019-07-01     87    A       a
2019-07-02     73    B       b
2019-07-03     79    C       c
2019-07-04     87    D       d
2019-07-05     74    E       e
2019-07-06     71    F       f
2019-07-07     65    G       g
2019-07-08     95    H       h
2019-07-09     80    I       i
2019-07-10     62    J       j
2019-07-11     68    K       k
2019-07-12     67    L       l
2019-07-13     83    M       m
2019-07-14     71    N       n
2019-07-15     69    O       o
2019-07-16     76    P       p
2019-07-17     79    Q       q
2019-07-18     75    R       r
2019-07-19     82    S       s
2019-07-20     93    T       t
2019-07-21     58    U       u
2019-07-22     73    V       v
2019-07-23     93    W       w
2019-07-24     85    X       x
2019-07-25     70    Y       y
2019-07-26     58    Z       z

In [82]:
data['date']=date
data

            marks name project       date
2019-07-01     87    A       a 2019-07-01
2019-07-02     73    B       b 2019-07-02
2019-07-03     79    C       c 2019-07-03
2019-07-04     87    D       d 2019-07-04
2019-07-05     74    E       e 2019-07-05
2019-07-06     71    F       f 2019-07-06
2019-07-07     65    G       g 2019-07-07
2019-07-08     95    H       h 2019-07-08
2019-07-09     80    I       i 2019-07-09
2019-07-10     62    J       j 2019-07-10
2019-07-11     68    K       k 2019-07-11
2019-07-12     67    L       l 2019-07-12
2019-07-13     83    M       m 2019-07-13
2019-07-14     71    N       n 2019-07-14
2019-07-15     69    O       o 2019-07-15
2019-07-16     76    P       p 2019-07-16
2019-07-17     79    Q       q 2019-07-17
2019-07-18     75    R       r 2019-07-18
2019-07-19     82    S       s 2019-07-19
2019-07-20     93    T       t 2019-07-20
2019-07-21     58    U       u 2019-07-21
2019-07-22     73    V       v 2019-07-22
2019-07-23     93    W       w 2019-07-23
2019-07-24     85    X       x 2019-07-24
2019-07-25     70    Y       y 2019-07-25
2019-07-26     58    Z       z 2019-07-26

In [86]:
data['weekday']=data.date.dt.weekday_name
data

            marks name project       date    weekday
2019-07-01     87    A       a 2019-07-01     Monday
2019-07-02     73    B       b 2019-07-02    Tuesday
2019-07-03     79    C       c 2019-07-03  Wednesday
2019-07-04     87    D       d 2019-07-04   Thursday
2019-07-05     74    E       e 2019-07-05     Friday
2019-07-06     71    F       f 2019-07-06   Saturday
2019-07-07     65    G       g 2019-07-07     Sunday
2019-07-08     95    H       h 2019-07-08     Monday
2019-07-09     80    I       i 2019-07-09    Tuesday
2019-07-10     62    J       j 2019-07-10  Wednesday
2019-07-11     68    K       k 2019-07-11   Thursday
2019-07-12     67    L       l 2019-07-12     Friday
2019-07-13     83    M       m 2019-07-13   Saturday
2019-07-14     71    N       n 2019-07-14     Sunday
2019-07-15     69    O       o 2019-07-15     Monday
2019-07-16     76    P       p 2019-07-16    Tuesday
2019-07-17     79    Q       q 2019-07-17  Wednesday
2019-07-18     75    R       r 2019-07-18   Thursday
2019-07-19     82    S       s 2019-07-19     Friday
2019-07-20     93    T       t 2019-07-20   Saturday
2019-07-21     58    U       u 2019-07-21     Sunday
2019-07-22     73    V       v 2019-07-22     Monday
2019-07-23     93    W       w 2019-07-23    Tuesday
2019-07-24     85    X       x 2019-07-24  Wednesday
2019-07-25     70    Y       y 2019-07-25   Thursday
2019-07-26     58    Z       z 2019-07-26     Friday

In [90]:
data['dayofyear']=data.date.dt.dayofyear
data

            marks name project       date    weekday  dayofyear
2019-07-01     87    A       a 2019-07-01     Monday        182
2019-07-02     73    B       b 2019-07-02    Tuesday        183
2019-07-03     79    C       c 2019-07-03  Wednesday        184
2019-07-04     87    D       d 2019-07-04   Thursday        185
2019-07-05     74    E       e 2019-07-05     Friday        186
2019-07-06     71    F       f 2019-07-06   Saturday        187
2019-07-07     65    G       g 2019-07-07     Sunday        188
2019-07-08     95    H       h 2019-07-08     Monday        189
2019-07-09     80    I       i 2019-07-09    Tuesday        190
2019-07-10     62    J       j 2019-07-10  Wednesday        191
2019-07-11     68    K       k 2019-07-11   Thursday        192
2019-07-12     67    L       l 2019-07-12     Friday        193
2019-07-13     83    M       m 2019-07-13   Saturday        194
2019-07-14     71    N       n 2019-07-14     Sunday        195
2019-07-15     69    O       o 2019-07-15     Monday        196
2019-07-16     76    P       p 2019-07-16    Tuesday        197
2019-07-17     79    Q       q 2019-07-17  Wednesday        198
2019-07-18     75    R       r 2019-07-18   Thursday        199
2019-07-19     82    S       s 2019-07-19     Friday        200
2019-07-20     93    T       t 2019-07-20   Saturday        201
2019-07-21     58    U       u 2019-07-21     Sunday        202
2019-07-22     73    V       v 2019-07-22     Monday        203
2019-07-23     93    W       w 2019-07-23    Tuesday        204
2019-07-24     85    X       x 2019-07-24  Wednesday        205
2019-07-25     70    Y       y 2019-07-25   Thursday        206
2019-07-26     58    Z       z 2019-07-26     Friday        207

In [1]:
##creating IPs
from cyberpandas import IPArray

In [2]:
ip1=IPArray(3232235779)
ip1

IPArray(['192.168.1.3'])

In [3]:
ip=IPArray(10000)
ip

IPArray(['0.0.39.16'])

In [4]:
ipdata=[IPArray(var) for var in range(3232235779,3232235805)]
data['ip']=ipdata
data

NameError: name 'IPArray' is not defined